<?php

namespace App\Console\Commands;

use App\Models\City;
use App\Models\ParserCompany;
use Illuminate\Console\Command;
use Psy\Exception\ErrorException;
use Yangqi\Htmldom\Htmldom;

use Symfony\Component\Console\Helper\ProgressBar;

class ParseCitysites extends Command
{
    /**
     * The name and signature of the console command.
     *
     * @var string
     */
    protected $signature = 'parse:citysites';

    /**
     * The console command description.
     *
     * @var string
     */
    protected $description = 'Command description';

    protected $data = [];

    protected $siteList = [
        1 => 'http://www.0564.ua', //krivoy rog
        2 => 'http://www.056.ua', //dnepropetrovsk
        3 => 'http://www.44.ua', //kiev
        4 => 'http://www.032.ua', //lvov
    ];

    // krivoj rog
    /*protected $categoryList = [
        23 => [
            'name' => 'Авто',
            'resource_path' => 'catalog',
            'child' => [
                226 => "Авто в кредит",
                341 => "Автоаксессуары",
                69 => "Автозапчасти",
                608 => "Автокраны и автовышки",
                71 => "Автомойки",
                68 => "Автосалоны",
                488 => "Автострахование",
                484 => "Автохимия",
                606 => "Автохимчистка",
                74 => "Автошколы",
                335 => "Автоэвакуаторы",
                349 => "Автоэкспертиза",
                483 => "АЗС",
                373 => "Мониторинг транспорта и GPS",
                181 => "Мотоциклы, мопеды, мотоблоки",
                489 => "Охранные системы",
                482 => "Прокат и аренда авто",
                73 => "СТО и тюнинг",
                417 => "Стоянки, гаражи, парковки",
                586 => "Установка ГБО",
                487 => "Шины и диски"
            ]
        ],
        16 => [
            'name' => 'Бизнес услуги',
            'resource_path' => 'catalog',
            'child' => [
                23 => "Банки",
                192 => "Биржи",
                93 => "Бухгалтерские и аудиторские услуги",
                739 => "Детективные агентства",
                24 => "Иммиграционные услуги",
                229 => "Кредитные союзы",
                189 => "Курьерские службы",
                92 => "Менеджмент и консалтинг",
                155 => "Нотариусы",
                497 => "Организация выставок",
                29 => "Охранная деятельность",
                26 => "Переводы иностранных языков",
                28 => "Страхование",
                25 => "Таможенные услуги",
                626 => "Финансовые услуги",
                521 => "Штампы и печати",
                409 => "Экономическая диагностика и экономическая безопасность предприятий",
                366 => "Экспертная оценка",
                27 => "Юридические услуги"
            ]
        ],
        22 => [
            'name' => 'Бытовая техника',
            'resource_path' => 'catalog',
            'child' => [
                62 => "Аудио-, теле-, видеотехника",
                227 => "Бытовая техника",
                178 => "Кондиционеры и вентиляция",
                63 => "Ремонт, установка, сервис",
                64 => "Теплотехника",
                179 => "Электроосветительная техника"
            ]
        ],
        41 => [
            'name' => 'Городские службы',
            'resource_path' => 'catalog',
            'child' => [
                308 => "Аварийные службы",
                720 => "Архивы",
                709 => "Военные комиссариаты",
                722 => "Вокзалы и аэропорт",
                714 => "ГАИ",
                307 => "Жилищно-коммунальные предприятия",
                715 => "Инспекции",
                358 => "Исполком городского совета",
                269 => "Исполкомы районных советов",
                638 => "Милиция",
                716 => "Налоговые инспекции",
                640 => "Паспортные отделения",
                719 => "Пенсионные фонды",
                712 => "Прокуратура",
                306 => "Работа с предпринимателями",
                708 => "РАГСы (ЗАГСы)",
                721 => "СБУ",
                717 => "Социальные службы",
                711 => "Суды",
                710 => "Таможни",
                738 => "Управляющие компании",
                718 => "Центры занятости"
            ]
        ],
        51 => [
            'name' => 'Зоомир',
            'resource_path' => 'catalog',
            'child' => [
                260 => "Ветеринарные клиники",
                472 => "Гостиницы для животных",
                683 => "Дрессировка собак",
                252 => "Зоотовары",
                471 => "Клуб любителей животных",
                401 => "Питомники",
                734 => "Стрижка собак"
            ]
        ],
    ];*/


    /*
    55
    58
    56
    27
    21
    34
    50
    24
    28
    42
    45
    35
    57
    32
    44
    26
    25
    17
    38
    49
    37
    40
    20
    48*/

    //Kyiv
    protected $categoryList = [
//        23 => [
//            'name' => 'Авто',
//            'resource_path' => 'catalog',
//            'child' => [
////                226 => "Авто в кредит",
////                341 => "Автоаксессуары",
////                69 => "Автозапчасти",
////                608 => "Автокраны и автовышки",
//                71 => "Автомойки",
////                68 => "Автосалоны",
////                488 => "Автострахование",
////                484 => "Автохимия",
////                606 => "Автохимчистка",
////                74 => "Автошколы",
////                335 => "Автоэвакуаторы",
////                349 => "Автоэкспертиза",
////                483 => "АЗС",
////                373 => "Мониторинг транспорта и GPS",
////                181 => "Мотоциклы, мопеды, мотоблоки",
////                489 => "Охранные системы",
////                482 => "Прокат и аренда авто",
////                73 => "СТО и тюнинг",
////                417 => "Стоянки, гаражи, парковки",
////                586 => "Установка ГБО",
////                487 => "Шины и диски"
//            ]
//        ],
        58 => [
            'name' => 'Красота и здоровье',
            'resource_path' => 'catalog',
            'child' => [
                '520' => 'Салон красоты',
            ]
        ],
    ];

    // Lvov

//    protected $categoryList = [
//        23 => [
//            'name' => 'Авто',
//            'resource_path' => 'catalog',
//            'child' => [
//                341 => "Автоаксесуари",
//                349 => "Автоекспертиза",
//                69 => "Автозапчастини",
//                71 => "Автомийки",
//                481 => "Автоперевезення",
//                68 => "Автосалони",
//                74 => "Автошколи",
//                483 => "АЗС",
//                985 => "Встановлення ГБО",
//                335 => "Евакуатори",
//                373 => "Моніторинг транспорту,  GPS",
//                181 => "Мотоцикли, мопеди, мотоблоки",
//                482 => "Прокат та оренда авто",
//                73 => "СТО",
//                417 => "Стоянки, гаражі, парковки",
//                984 => "Тюнінг",
//                935 => "Шини, диски",
//            ]
//        ],
//        16 => [
//            'name' => 'Бізнес послуги',
//            'resource_path' => 'catalog',
//            'child' => [
//                527 => "Адвокати",
//                23 => "Банки",
//                192 => "Біржі",
//                93 => "Бухгалтерські послуги, аудит",
//                636 => "Графічний дизайн",
//                366 => "Експертна оцінка",
//                582 => "Інформаційні послуги",
//                976 => "Конференц-зали",
//                930 => "Краудфандинг",
//                749 => "Кредити, фінанси",
//                189 => "Кур'єрські служби, кур'єри",
//                661 => "Лізинг",
//                355 => "Ломбарди",
//                92 => "Менеджмент та консалтинг",
//                25 => "Митні послуги",
//                155 => "Нотаріуси",
//                651 => "Обслуговування бізнесу",
//                26 => "Переклади іноземних мов",
//                944 => "Печатки та штампи",
//                650 => "Рекрутинг и HR",
//                642 => "Соціологічні та маркетингові дослідження",
//                28 => "Страхування",
//                702 => "Фінансові піраміди",
//                703 => "Фінансові послуги",
//                27 => "Юридичні послуги",
//            ]
//        ],
//        37 => [
//            'name' => 'Будівництво (послуги)',
//            'resource_path' => 'catalog',
//            'child' => [
//                340 => "Архітектура",
//                232 => "Будівельні і ремонтні роботи",
//                639 => "Будівельні компанії",
//                331 => "Електрозварювальні роботи",
//                332 => "Електромонтажні роботи",
//                422 => "Натяжні стелі",
//                638 => "Оздоблювальні роботи",
//                231 => "Проектні роботи, дизайн",
//                874 => "Промисловий альпінізм",
//                406 => "Пуско-налагоджувальні роботи, електропостачання",
//                961 => "Реставрація ванн",
//                387 => "Сантехнічні послуги",
//                875 => "Транспортні роботи",
//                384 => "Укладка та шліфування підлоги",
//                970 => "Утеплення фасадів",
//            ]
//        ],
//        49 => [
//            'name' => 'Будівництво (продукція)',
//            'resource_path' => 'catalog',
//            'child' => [
//                867 => "Автономні системи життєзабезпечення",
//                975 => "Альтернативні джерела енергії",
//                670 => "Будівельні магазини",
//                233 => "Будівельні матеріали",
//                932 => "Вироби з граніту",
//                230 => "Вікна, жалюзі",
//                271 => "Ворота, ролети, огорожа, огородження",
//                410 => "Двері (міжкімнатні, вхідні)",
//                939 => "Електроінструменти",
//                396 => "Кабельно-провідникова продукція",
//                383 => "Ковані вироби",
//                966 => "Ліфти, ескалатори, траволатори",
//                370 => "Металоконструкції",
//                705 => "Металопрокат",
//                538 => "Обробні матеріали, декоративні матеріали",
//                869 => "Освітлення",
//                369 => "Печі, каміни,сауни",
//                261 => "Плитка і сантехніка",
//                386 => "Покриття для підлоги",
//                408 => "Покрівельні матеріали",
//                870 => "Профнастил",
//                535 => "Розумний дім, інтеллектуальні системи",
//                955 => "Сайдинг",
//                537 => "Системи опалення, водопостачання",
//                329 => "Скло, дзеркала",
//                871 => "Спецодяг",
//                371 => "Столярні вироби",
//                868 => "Шпалери, фотошпалери",
//            ]
//        ],
//
//        66 => [
//            'name' => 'Готелі, хостели, апартаменти',
//            'resource_path' => 'catalog',
//            'child' => [
//                693 => "Апартаменти",
//                691 => "Готелі",
//                694 => "Оренда квартир",
//                692 => "Хостели",
//            ]
//        ],
//
//        60 => [
//            'name' => 'Езотерика, магія',
//            'resource_path' => 'catalog',
//            'child' => [
//                717 => "Ворожки",
//                542 => "Езотерика",
//                541 => "Езотеричні товари",
//                543 => "Магія",
//            ]
//        ],
//        67 => [
//            'name' => 'Екскурсії',
//            'resource_path' => 'catalog',
//            'child' => [
//                700 => "Екскурсії по місцям культурної спадщини",
//                696 => "Екскурсії по середньовічним замкам",
//                701 => "Індивідуальні екскурсії",
//                697 => "Нічні екскурсії",
//                698 => "Оглядові екскурсії",
//                695 => "Тематичні екскурсії",
//                699 => "Тури в Карпати",
//            ]
//        ],
//        38 => [
//            'name' => 'ЗМІ',
//            'resource_path' => 'catalog',
//            'child' => [
//                265 => 'Інтернет ЗМІ',
//                235 => 'Преса',
//                236 => 'Радіо',
//                237 => 'Телебачення',
//            ]
//        ],
//
//        51 => [
//            'name' => 'Зоосвіт',
//            'resource_path' => 'catalog',
//            'child' => [
//                923 => 'Ветаптеки, ветпрепарати',
//                260 => 'Ветеринарні клініки',
//                540 => 'Зоосалони, грумінг',
//                252 => 'Зоотовари, зоомагазини',
//                676 => 'Клуб любителів тварин',
//            ]
//        ],
//
//        65 => [
//            'name' => 'Інтернет-магазини',
//            'resource_path' => 'catalog',
//            'child' => [
//                616 =>'Автозапчастини, обладнання',
//                739 =>'Аксесуари, годинники',
//                748 =>'Алкогольні напої',
//                740 =>'Аудіо, відео, фото, ТВ',
//                743 =>'Будівельні товари',
//                629 =>'Будівельні товари, електроінструменти та обладнання',
//                618 =>'Дитячі товари, іграшки',
//                648 =>'Доставка продуктів та їжі',
//                630 =>'Зоосвіт',
//                619 =>'Інтимні товари',
//                631 =>'Кліматична техніка, кондиціонери, обігрівачі',
//                620 =>'Книжки, канцтовари, CD диски',
//                621 =>'Комп\'ютери та комплектуючі',
//                622 =>'Косметика, парфумерія',
//                623 =>'Меблі',
//                741 =>'Медицина',
//                625 =>'Мобільні телефони та аксесуари',
//                626 =>'Одяг, взуття, аксесуари',
//                747 =>'Офісна техніка, оргтехніка, мережеве обладнання',
//                617 =>'Побутова техніка, електроніка',
//                633 =>'Подарунки, сувеніри, квіти',
//                632 =>'Різне',
//                745 =>'Сантехніка',
//                962 =>'Світильники, люстри, торшери',
//                746 =>'Системи очистки води, фільтри для води',
//                744 =>'Спорттовари, товари для відпочинку, хобі, туризму',
//                637 =>'Товари для дому',
//                742 =>'Товари для полювання та рибальства',
//            ]
//        ],
//
//        15 => [
//            'name' => 'Комп\'ютери,  інтернет',
//            'resource_path' => 'catalog',
//            'child' => [
//                733 =>'CD,DVD, флеш-карти',
//                94 =>'Веб-дизайн (створення сайтів)',
//                156 =>'Заправка картриджів, витратні матеріали',
//                734 =>'Ігрові приставки',
//                19 =>'Інтернет-провайдери',
//                502 =>'Комп\'ютери та ПЗ',
//                20 =>'Комп\'ютери, складники, ноутбуки',
//                22 =>'Комп\'ютерні клуби',
//                95 =>'Комп\'ютерні послуги та сервіс',
//                99 =>'Оргтехніка',
//                974 =>'Ремонт ноутбуків та комп`ютерів',
//                204 =>'Ремонт оргтехніки',
//                196 =>'Розробка та продаж ПЗ',
//                167 =>'Хостинг та домени',
//            ]
//        ],
//
//        58 => [
//            'name' => 'Краса та здоров\'я',
//            'resource_path' => 'catalog',
//            'child' => [
//                566 => 'Візаж',
//                690 => 'Депіляція, епіляція та омолодження',
//                519 => 'Йога',
//                735 => 'Косметика, парфумерія, продукція для манікюру',
//                736 => 'Косметологія',
//                992 => 'Манікюр та педикюр',
//                518 => 'Масаж',
//                737 => 'Нарощування волосся',
//                564 => 'Перукарні',
//                953 => 'Послуги стилістів та іміджмейкерів',
//                520 => 'Салони краси',
//                521 => 'Солярії',
//                517 => 'Схуднення, Очищення, Оздоровлення',
//                738 => 'Центри здорового харчування',
//            ]
//        ],
//
//        42 => [
//            'name' => 'Курси, тренінги, навчальні заклади',
//            'resource_path' => 'catalog',
//            'child' => [
//                240 => 'Бібліотеки',
//                238 => 'Вищі навчальні заклади',
//                562 => 'Дитячі центри',
//                732 => 'Довузівська підготовка',
//                601 => 'Дошкільні заклади',
//                374 => 'Загальноосвітні школи',
//                660 => 'Інше',
//                344 => 'Комп\'ютерні курси',
//                940 => 'Курси англійскої мови',
//                487 => 'Курси бойових мистецтв',
//                376 => 'Курси водіїв',
//                241 => 'Курси іноземних мов',
//                345 => 'Курси косметології, макіяжу, масажу, перукарів',
//                525 => 'Курси манікюру і педікюру',
//                342 => 'Курси підвищення кваліфікації',
//                954 => 'Курси стилістів та іміджмейкерів',
//                343 => 'Курси фінансистів та бухгалтерів, 1С',
//                488 => 'Курси фотографів',
//                295 => 'Модельні агенції',
//                658 => 'Музичні навчальні заклади',
//                490 => 'Науково-дослідні установи',
//                336 => 'Освіта за кордоном',
//                367 => 'Технікуми, училища, коледжи',
//                296 => 'Тренінги, семінари',
//                526 => 'Школи танців',
//                662 => 'Шоу-бізнес',
//            ]
//        ],
//
//        27 => [
//            'name' => 'Меблі',
//            'resource_path' => 'catalog',
//            'child' => [
//                228 => 'Виготовлення меблів',
//                957 => 'Дитячі меблі',
//                686 => 'Кухні',
//                729 => 'М\'ягкі меблі',
//                685 => 'Матраци',
//                157 => 'Меблева фурнітура',
//                943 => 'Меблі для готелів та ресторанів',
//                127 => 'Меблі для дому',
//                128 => 'Меблі для офісу',
//                674 => 'Ремонт меблів',
//                382 => 'Сейфи',
//                687 => 'Шафи-купе',
//                958 => 'Шкільні меблі',
//            ]
//        ],
//
//        21 => [
//            'name' => 'Медицина, здоров\'я',
//            'resource_path' => 'catalog',
//            'child' => [
//                53 => 'Аптеки',
//                679 => 'Гінекологія',
//                360 => 'Диспансери',
//                680 => 'Корекція зору, оптика',
//                731 => 'Косметичні препарати, фітопрепарати',
//                54 => 'Лікарні та полікліники',
//                579 => 'Лікувально-діагностичні центри',
//                711 => 'Лікування наркоманії, алкоголізму та нікотинової залежності',
//                587 => 'Медичні лабораторії',
//                56 => 'Медичні та оздоровчі центри',
//                392 => 'Медичні товари',
//                730 => 'Нетрадиційна медицина',
//                330 => 'Пластична хірургія, косметологія',
//                57 => 'Пологові заклади',
//                710 => 'Послуги психолога',
//                709 => 'Соляні кімнати',
//                58 => 'Стоматологія',
//                947 => 'УЗД',
//            ]
//        ],
//
//        41  => [
//            'name' => 'Міські служби',
//            'resource_path' => 'catalog',
//            'child' => [
//                753 => 'Аварійні служби',
//                751 => 'Автовокзали',
//                752 => 'Аеропорти',
//                762 => 'Виконавчі служби',
//                647 => 'Відділення міліції',
//                754 => 'Військові частини',
//                756 => 'ДАІ',
//                764 => 'Державні служби',
//                757 => 'Дитячі будинки, притулки',
//                567 => 'Довідкові служби',
//                941 => 'Дошкільні навчальні заклади, дитячі садки',
//                777 => 'Екстренні служби',
//                758 => 'Залізничні вокзали',
//                761 => 'Інспекції',
//                763 => 'Кладовища',
//                307 => 'ЛКП',
//                774 => 'Митниці',
//                755 => 'Міська рада',
//                890 => 'Морги',
//                765 => 'Обласна адміністрація',
//                766 => 'Паспортні служби',
//                767 => 'Посольства',
//                611 => 'Пошта ',
//                946 => 'Приватні навчальні заклади',
//                769 => 'Прокуратура',
//                770 => 'РАГСи',
//                771 => 'Районні адміністрації',
//                645 => 'Служби, інспекції',
//                646 => 'Суди',
//                776 => 'Тюрми, колонії, СІЗО',
//                644 => 'Фонди',
//                956 => 'Церкви, костели, релігійні громади',
//                945 => 'Школи, гімназії, ліцеї',
//            ]
//        ],
//        34  => [
//            'name' => 'Мобільний зв\'язок та телекомунікації',
//            'resource_path' => 'catalog',
//            'child' => [
//                400 => 'Кабельне телебачення',
//                372 => 'Міська телефонія',
//                971 => 'Мобільні аксесуари',
//                173 => 'Мобільні оператори',
//                174 => 'Мобільні телефони',
//                175 => 'Ремонт телефонів, сервіс',
//                399 => 'Супутникове телебачення',
//            ]
//        ],
//        50  => [
//            'name' => 'Музичні інструменти',
//            'resource_path' => 'catalog',
//            'child' => [
//                389 => 'Акустичний, класичний інструмент',
//                388 => 'Електронні інструменти',
//            ]
//        ],
//        24  => [
//            'name' => 'Нерухомість',
//            'resource_path' => 'catalog',
//            'child' => [
//                103 => 'Агентства нерухомості',
//                413 => 'Житлові комплекси',
//                480 => 'Комерційна нерухомість',
//                159 => 'Оренда житла',
//            ]
//        ],
//        28  => [
//            'name' => 'Обладнання',
//            'resource_path' => 'catalog',
//            'child' => [
//                215 => 'Автообладнання',
//                133 => 'Банківське, офісне обладнання',
//                377 => 'Будівельне обладнання',
//                272 => 'Водоочисне обладнання, каналізація, біотуалети',
//                995 => 'Гідравлічне обладнання',
//                134 => 'Деревопереробка, метал',
//                394 => 'Домофони, відеодомофони',
//                669 => 'Електричне, ядерне обладнання',
//                602 => 'Електронне обладнання',
//                141 => 'Електротехнічне обладнання',
//                191 => 'Зварювальне, газополуменеве обладнання',
//                491 => 'Інше обладнання',
//                421 => 'Компресорне обладнання',
//                965 => 'Ліфтове обладнання',
//                136 => 'Медичне обладнання',
//                414 => 'Насосне обладнання',
//                506 => 'Обладнання',
//                942 => 'Обладнання для СТО',
//                262 => 'Опалювальне обладнання',
//                137 => 'Охоронне, пожежне обладнання',
//                264 => 'Підіймально-транспортне обладнання',
//                678 => 'Пневматичне обладнання',
//                605 => 'Промислове обладнання',
//                356 => 'Сауни, басейни',
//                317 => 'Системи кондиціювання, вентиляції',
//                139 => 'Телекомунікаційне обладнання',
//                728 => 'Теплотехнічне обладнання',
//                140 => 'Торгівельне обладнання',
//                675 => 'Точне обладнання',
//                138 => 'Харчове обладнання',
//                362 => 'Холодильне та кліматичне обладнання',
//            ]
//        ],
//        45  => [
//            'name' => 'Оптові бази, склади, ринки',
//            'resource_path' => 'catalog',
//            'child' => [
//                321 => 'Оптова торгівля',
//                606 => 'Ринки',
//                513 => 'Склади',
//            ]
//        ],
//        35  => [
//            'name' => 'Организації та представництва',
//            'resource_path' => 'catalog',
//            'child' => [
//                205 => 'Громадські організації',
//                657 => 'Культурна діяльність',
//                368 => 'Молодіжні організації',
//                206 => 'Партія',
//                649 => 'Посольства',
//                208 => 'Релігійні організації',
//                209 => 'Фонди, Центри',
//            ]
//        ],
//        115 => [
//            'name' => 'Охоронні послуги, безпека',
//            'resource_path' => 'catalog',
//            'child' => [
//                884 => 'GPS контроль',
//                964 => 'Детективні послуги',
//                29 => 'Охоронна діяльність',
//                885 => 'Охоронні агенства',
//                887 => 'Охоронні послуги',
//                886 => 'Охоронні системи безпеки',
//                888 => 'Системи відеонагляду',
//                889 => 'Юридичні консультації',
//            ]
//        ],
//        32  => [
//            'name' => 'Перевезення',
//            'resource_path' => 'catalog',
//            'child' => [
//                857 => 'Авіаперевезення',
//                148 => 'Вантажні перевезення',
//                858 => 'Залізнодорожні перевезення',
//                990 => 'Квартирний переїзд',
//                672 => 'Логістика',
//                991 => 'Офісний переїзд',
//                268 => 'Пасажирські перевезення',
//            ]
//        ],
//        22  => [
//            'name' => 'Побутова техніка',
//            'resource_path' => 'catalog',
//            'child' => [
//                62 => 'Аудіо-, теле-, відеотехніка',
//                179 => 'Електроосвітлювальна техніка',
//                178 => 'Кондиціонери та вентилятори',
//                227 => 'Побутова техніка',
//                656 => 'Ремонт, встановлення, сервіс',
//                64 => 'Теплотехніка',
//            ]
//        ],
//        17  => [
//            'name' => 'Поліграфія та реклама',
//            'resource_path' => 'catalog',
//            'child' => [
//                681 =>'Виготовлення відео роликів',
//                41 =>'Видавництва і типографії',
//                713 =>'Друк на тканині',
//                684 =>'Друкарні',
//                938 =>'Зовнішня реклама',
//                584 =>'Інтернет-реклама',
//                641 =>'Матеріали, обладнання',
//                643 =>'Переплетні послуги',
//                931 =>'Поліграфія',
//                688 =>'Реклама в ліфтах',
//                714 =>'Реклама на транспорті',
//                563 =>'Рекламні агенції',
//                45 =>'Рекламні послуги',
//                200 =>'Сувенірна продукція',
//                278 =>'Широкоформатний друк',
//            ]
//        ],
//        20  => [
//            'name' => 'Послуги',
//            'resource_path' => 'catalog',
//            'child' => [
//                49 => 'Ательє, пошиття одягу',
//                258 => 'Доставка води',
//                907 => 'Доставка квітів',
//                937 => 'Електроремонтні роботи',
//                583 => 'Інформаційні технології',
//                510 => 'Інші послуги',
//                988 => 'Камери зберігання',
//                492 => 'Кейтерінг',
//                162 => 'Клінінгові послуги',
//                720 => 'Ландшафтний дизайн, благоустрій території',
//                936 => 'Побутові послуги',
//                989 => 'Пошиття штор, тюль',
//                594 => 'Прокат транспорту',
//                654 => 'Ремонтні майстерні',
//                46 => 'Ритуальні послуги',
//                385 => 'Санітарна обробка',
//                294 => 'Фотопослуги',
//                47 => 'Хімчистки та пральні',
//                993 => 'Шлюбні агенства',
//            ]
//        ],
//        26  => [
//            'name' => 'Промисловість',
//            'resource_path' => 'catalog',
//            'child' => [
//                475 => 'Горновидобувні підприємства',
//                245 => 'Енергетика і паливо',
//                663 => 'Заводи',
//                665 => 'Легка промисловість',
//                242 => 'Машинобудування',
//                706 => 'Металопрокат',
//                121 => 'Металургія',
//                667 => 'Хімічна промисловість',
//                673 => 'Шкло-керамічна промисловість',
//            ]
//        ],
//        25  => [
//            'name' => 'Робота',
//            'resource_path' => 'catalog',
//            'child' => [
//                113 => 'Кадрові агенції',
//                865 => 'Робота за кордоном',
//            ]
//        ],
//        44  => [
//            'name' => 'Святкові послуги',
//            'resource_path' => 'catalog',
//            'child' => [
//                973 => 'Банкетні зали',
//                280 => 'Весільні послуги',
//                817 => 'Весільні салони',
//                861 => 'Виготовлення запрошень',
//                292 => 'Виїздне обслуговування',
//                285 => 'Відеозйомка',
//                862 => 'Обслуговування урочистих подій',
//                281 => 'Організація святкових заходів',
//                860 => 'Оренда ресторанного обладнання',
//                859 => 'Оренда та прокат лімузинів, ретро авто',
//                282 => 'Оренда транспорту',
//                287 => 'Оформлення квітами',
//                286 => 'Оформлення кулями',
//                863 => 'Прокат карнавальних костюмів',
//                677 => 'Світлово-, звукове обладнання',
//                283 => 'Тамада, ведучий',
//                864 => 'Торти на замовлення',
//                291 => 'Феєрверки та салюти',
//                284 => 'Фотозйомка',
//            ]
//        ],
//        62  => [
//            'name' => 'Сільське господарство',
//            'resource_path' => 'catalog',
//            'child' => [
//                574 => 'Агропромислові комплекси',
//                571 => 'Добрива',
//                570 => 'Насіння',
//                573 => 'Рослинництво',
//                572 => 'Сільськогосподарська техніка та обладнання',
//            ]
//        ],
//        120 => [
//            'name' => 'Спорт',
//            'resource_path' => 'catalog',
//            'child' => [
//                904 => 'Активний відпочинок',
//                905 => 'Басейни',
//                165 => 'Спортивні клуби',
//                906 => 'Спортивні клуби, федерації',
//                132 => 'Спортивні секції',
//                925 => 'Спорттовари',
//                909 => 'Фітнес клуби',
//                910 => 'Школи танцю',
//            ]
//        ],
//        57  => [
//            'name' => 'Таксопарки',
//            'resource_path' => 'catalog',
//            'child' => [
//                267 => 'Таксі'
//            ]
//        ],
//        55  => [
//            'name' => 'Творчість',
//            'resource_path' => 'catalog',
//            'child' => [
//                876 => 'Hand Made',
//                500 => 'Акторська майстерність',
//                494 => 'Живопис',
//                495 => 'Музика',
//                967 => 'Товари для рукоділля',
//            ]
//        ],
//        40  => [
//            'name' => 'Торгівля, товари',
//            'resource_path' => 'catalog',
//            'child' => [
//                249 => 'Алкогольні і тютюнові вироби',
//                718 => 'Безалкогольні напої',
//                158 => 'Господарські товари',
//                219 => 'Електротовари',
//                363 => 'Елітні кава, чай',
//                878 => 'Засоби індивідуального захисту',
//                485 => 'Інструменти',
//                211 => 'Килимові покриття, лінолеум',
//                250 => 'Побутова хімія',
//                607 => 'Спецвзуття та спецодяг',
//                610 => 'Тара та упаковка',
//                381 => 'Товари для дому',
//                347 => 'Товари для полювання та риболовлі',
//                704 => 'Фільтри для води',
//                609 => 'Фототовари',
//                270 => 'Штори, жалюзі, дзеркала',
//            ]
//        ],
//        59  => [
//            'name' => 'Туризм і відпочинок',
//            'resource_path' => 'catalog',
//            'child' => [
//                596 => 'Авіакомпанії',
//                911 => 'Автобусні тури',
//                987 => 'Болгарія',
//                460 => 'Будинки відпочинку, санаторії',
//                921 => 'Весільні тури',
//                920 => 'Відпочинок на морі',
//                963 => 'Відпочинок у Карпатах',
//                912 => 'Гірськолижні тури',
//                913 => 'Готелі',
//                914 => 'Діловий туризм',
//                922 => 'Екзотичні тури',
//                915 => 'Європа',
//                916 => 'Єгипет',
//                917 => 'Крим',
//                918 => 'ОАЕ',
//                919 => 'Оздоровчий туризм',
//                550 => 'Пансіонати',
//                547 => 'Санаторії',
//                532 => 'Турагенства',
//                986 => 'Туреччина',
//            ]
//        ],
//        48  => [
//            'name' => 'Ювелірні вироби',
//            'resource_path' => 'catalog',
//            'child' => [
//                354 => 'Ювелірні майстерні',
//            ]
//        ],
//
//    ];

    protected $html = '';

    /**
     * Create a new command instance.
     *
     * @return void
     */
    public function __construct()
    {
        parent::__construct();
    }

    public function getCountPage($url){
        $this->info('Please wait, we are collecting information about the parsing of pages!');
        $parseCount = 1;
        foreach ($this->categoryList as $id => $childrenCat) {
            foreach ($childrenCat['child'] as $idChild => $item) {
                $numberPage = 1;
                do {
                    try {
                        $parserUrl = $url . '/' . $childrenCat['resource_path'] . '/' . $id . '/' . $idChild . "/page/" . $numberPage;

                        $this->html = $this->getHtml($parserUrl);

                    } catch (\Exception $e) {
                        $this->error($e);
                        $this->info('Page not found!');
                    }

                    if ($this->checkNextPage()) {
                        $numberPage++;
                    }
                    $parseCount++;
                } while ($this->checkNextPage());
            }
        }
        echo "\n Total Pages: \n";
        return $parseCount;
    }

    /**
     * Execute the console command.
     *
     * @return mixed
     */
    public function handle()
    {
        do {
            $cityId = (int)$this->ask('Enter City ID');
            /*$cityId = 2;*/

            $city = City::find($cityId);

            if (!$city) {
                $this->error('City not found!');
            }

            if ($city && !$this->confirm('Do you wish to parse city: "' . $city->name . '"" URL: "' . $this->siteList[$cityId] . '"? [y|N]')) {
                $city = null;
            }

        } while (!($city instanceof City));

        $url = $this->siteList[$cityId];

        $this->runParser($city, $url, $cityId);
    }

    protected function runParser(City $city, $url, $cityId)
    {

        $errorCount = 0;
        $currentCompany = 9;
        $parseCount = 1;

        $startTimeDisplay = date('d.m.Y - [h:i:s]');

        $this->comment("********         Start time: " . $startTimeDisplay . "          ********");

        $this->output->progressStart($this->getCountPage($url));

        $startTime = date_create();

        foreach ($this->categoryList as $id => $childrenCat) {
            foreach ($childrenCat['child'] as $idChild => $item) {
                $numberPage = 1;
                do {
                    try {
                        $parserUrl = $url . '/' . $childrenCat['resource_path'] . '/' . $id . '/' . $idChild . "/page/" . $numberPage;
                        /*$this->comment('************************************************************************');
                        $this->comment('');
                        $this->info('Try to parse id: ' . $currentCompany . ' URL: ' . $parserUrl);
                        $this->info(' Total parsed page: ' . $parseCount);*/

                        $this->html = $this->getHtml($parserUrl);

                        $arrayCompaniesBlocks = $this->html->find('.company_box');

                        $success = $this->parseData($arrayCompaniesBlocks, $idChild, $url, $this->data, $cityId);

                        sleep(1);
                        $this->output->progressAdvance();

                    } catch (\Exception $e) {
                        $this->error($e);
                        $this->info('Page not found!');
                    }

                    if ($success) {
                        /*$this->info('Success: ' . json_encode($this->data, JSON_UNESCAPED_UNICODE));*/
                        /*$this->comment('                            =============');
                        $this->comment('                            =  SUCCESS  =');
                        $this->comment('                            =============');*/

                    } else {
                        $errorCount++;
                        $this->info('Error! Total errors: ' . $errorCount);
                    }

                    if ($this->checkNextPage()) {
                        $numberPage++;
                    }
                    $parseCount++;
                } while ($this->checkNextPage());
            }
        }


        // for convert array display_category_id
        foreach ($this->data as $k => $item) {
            $this->data[$k]['display_category_id'] = json_encode($item['display_category_id']);
            $this->data[$k]['source'] = $cityId;
        }
        $this->output->progressFinish();
        $this->info('========================================');
        $this->info('Parser finished! Parsed: ' . $parseCount . ' pages');


        $finishTimeDisplay = date('d.m.Y - [h:i:s]');

        $endTime   = date_create();

        $totalTime = date_diff($endTime, $startTime);

        $this->comment('********         Finish time: ' . $finishTimeDisplay . "         ********");
        $this->comment('********              Total time parse: ' . $totalTime->format('%H:%I:%S') . "              ******** \n");

        /*var_dump($this->data);*/
        
        $this->saveData($this->data);

    }

    protected function saveData($data)
    {
        try {
            foreach ($data as $k => $item) {

                //hack for named pages
//                if (intval($k) <= 0) {
//                    continue;
//                }

                $parseTable = ParserCompany::where('source_id', $k)->first();
                if ($parseTable) {
                    ParserCompany::where('source_id', $k)->update($item);
                } else {
                    $parseTable = new ParserCompany($this->data[$k]);
                    $parseTable->save();
                }
            }
        } catch (Exception $e) {
            $this->error($e);
        }

    }

    protected function checkNextPage()
    {
        if ($this->html->find('a.loader')) {
            return true;
        }
        return false;
    }

    protected function getHtml($url)
    {
        return new Htmldom($url);
    }

    protected function parseData($arrayCompaniesBlocks, $displayCategory, $url, $companies, $cityId)
    {

        if (!$this->html) {
            $this->error('HTML is empty!');

            return false;
        }

        foreach ($arrayCompaniesBlocks as $blockCompany) {
            $id = $this->parseId($blockCompany);

            if (array_key_exists($id, $companies)) {
                $this->data[$id] = $companies[$id];
                $this->data[$id]['display_category_id'] = array_merge($companies[$id]['display_category_id'],
                    [$displayCategory]);
            } else {
                $this->data[$id]['source_id'] = $id;
                $this->data[$id]['name'] = $this->parseName($blockCompany);
                $this->data[$id]['desc'] = '';//trim($this->parseDescription($blockCompany));
                $this->data[$id]['display_category_id'] = [$displayCategory];
                if ($this->checkOutLink($blockCompany)) {
                    $parserUrlCompany = $url . '/catalog/full/' . $id;
                } else {
                    $parserUrlCompany = $blockCompany->find('.company_title .text_header a', 0)->href;
                }
                $this->data[$id]['city_id'] = $cityId;
                $htmlCompany = $this->getHtml($parserUrlCompany);
                $this->data[$id]['category_id'] = $this->parseCategory($htmlCompany);
                $this->data[$id]['phone'] = $this->parsePhone($htmlCompany);
                $this->data[$id]['address'] = $this->parseAddress($htmlCompany);
                $this->data[$id]['work_time'] = '[]';//$this->parseWorkTime($htmlCompany);
                $this->data[$id]['email'] = '[]';//$this->parseEmail($htmlCompany);
                $this->data[$id]['website'] = '[]';//$this->parseWebSite($htmlCompany);
                $this->data[$id]['url'] = $parserUrlCompany;
            }
        }
        return true;
    }

    protected function parseCategory($htmlCompany)
    {
        $breadcrumbs = $htmlCompany->find('.tree', 0);
        $url = $breadcrumbs->find('li a', 3)->href;
        $explodeUrl = explode('/', $url);
        $count = count($explodeUrl);
        $id = $explodeUrl[$count - 1];

        return $id;
    }

    protected function parseName($blockCompany)
    {
        return $blockCompany->find('.company_title .text_header a', 0)->innertext;
    }

    protected function checkOutLink($blockCompany)
    {
        $url = $blockCompany->find('.company_title .text_header a', 0)->href;
        $explodeUrl = explode('/', $url);
        $count = count($explodeUrl);

        if ($explodeUrl[0] == "" and intval($explodeUrl[$count - 1]) >= 0) {
            return true;
        }

        return false;
    }

    protected function parseId($blockCompany)
    {
        $url = $blockCompany->find('.company_title .text_header a', 0)->href;
        $explodeUrl = explode('/', $url);
        $count = count($explodeUrl);

        if ($explodeUrl[0] == 'http:' and $explodeUrl[$count - 1] == "") {
            $explodeDomain = explode('.', $explodeUrl[2]);
            $id = $explodeDomain[0];
        } else {
            if ($explodeUrl[0] == "" and intval($explodeUrl[$count - 1]) >= 0) {
                $id = $explodeUrl[$count - 1];
            }
        }

        return $id;
    }

    protected function parsePhone($htmlCompany)
    {
        try {
            foreach ($htmlCompany->find('.info_box') as $infoBox) {

                $titleNode = $infoBox->find('.name', 0);

                $title = $titleNode->plaintext;

                //md5 of 'Телефон'
                if (md5($title) == 'c0a28145eb82712dbb5b4e39113f3eb6') {
                    $phone = trim($infoBox->find('.text', 0)->plaintext);
                    break;
                }

            }
        } catch (\Exception $e) {
            $phone = null;
        }

        $phones = explode('+', $phone);
        if (count($phones) > 1) {
            unset($phones[0]);
        }
        $phones = array_values($phones);

        foreach ($phones as $k => $item) {
            $cnt = 0;
            $str = [];
            for ($i = 0; $i < strlen($item); $i++) {
                /*if ($item[$i] == '(') {
                    $cnt++;
                }*/
                if ($item[$i] == ',') {
                    $cnt = 2;
                }
                if ($cnt != 2) {
                    $str[$i] = $item[$i];
                } else {
                    break;
                }
            };
            $phones[$k] = implode($str);
        }

        $phones = json_encode($phones);

        return $phones;
    }

    protected function parseAddress($htmlCompany)
    {
        $address = null;
        try {

            foreach ($htmlCompany->find('.info_box') as $infoBox) {

                $titleNode = $infoBox->find('.name', 0);

                $title = $titleNode->plaintext;

                //md5 of 'Адресс'
                if (md5($title) == 'dd71916c4e5e3204c11a0ba115ddc1fe') {
                    foreach ($infoBox->find('.text') as $item) {
                        foreach ($item->find('.address') as $address1) {
                            $address[] = str_replace("\"", "'", $address1->innertext);
                        }
                    }
                    break;
                }
            }
        } catch (\Exception $e) {
            $address = null;
        }
        $address = json_encode($address, JSON_UNESCAPED_UNICODE);
        return $address;

    }

    protected function parseDescription($blockCompany)
    {
        return $blockCompany->find('.description p', 0)->innertext;
    }

    protected function parseWorkTime($htmlCompany)
    {
        $workTime = null;
        try {

            foreach ($htmlCompany->find('.info_box') as $infoBox) {

                $titleNode = $infoBox->find('.name', 0);

                $title = $titleNode->plaintext;
                //md5 of 'Время работы' md5("Время работы ")
                if (md5($title) == '298c0cfe6b2ac259e44269c7738cdf8d') {

                    $workTime = $infoBox->find('.text', 0)->innertext;

                    break;
                }
            }
        } catch (\Exception $e) {
            $workTime = null;
        }
        return $workTime;
    }

    protected function parseEmail($htmlCompany)
    {
        $email = null;
        /*try {*/

        foreach ($htmlCompany->find('.info_box') as $infoBox) {

            $titleNode = $infoBox->find('.name', 0);

            $title = $titleNode->plaintext;

            //md5 of 'Email адрес' md5("Email адрес ")
            if ($title == 'Email адрес ') {

                $email = $infoBox->find('.text', 0)->innertext;

                preg_match("/(mail_user = '([^&]*)';)|(mail_host = '@'+ '([^&]*)';)/", $email, $matches);

                break;
            }
        }
        /*} catch (\Exception $e) {
            $email = null;
        }*/
        return $email;
    }

    protected function parseWebSite($htmlCompany)
    {
        $site = null;
        try {

            foreach ($htmlCompany->find('.info_box') as $infoBox) {

                $titleNode = $infoBox->find('.name', 0);

                $title = $titleNode->plaintext;

                //md5 of 'Сайт' md5("Сайт1 ")
                if ($title == 'Сайт ') {

                    $site = $infoBox->find('.text a', 0)->href;

                    break;
                }
            }
        } catch (\Exception $e) {
            $site = null;
        }
        return $site;
    }


}
